app/controllers/banks_controller.rb

  def show
    @bank = Bank.find_by(routing_num: params[:id])
---
SELECT  "banks".* FROM "banks" WHERE "banks"."routing_num" = $1 LIMIT 1  [["routing_num", 11104209]]